<?php
/**
 * 易优CMS
 * ============================================================================
 * 版权所有 2016-2028 海南赞赞网络科技有限公司，并保留所有权利。
 * 网站地址: http://www.eyoucms.com
 * ----------------------------------------------------------------------------
 * 如果商业用途务必到官方购买正版授权, 以免引起不必要的法律纠纷.
 * ============================================================================
 * Author: 小虎哥 <1105415366@qq.com>
 * Date: 2018-06-23
 */

return array(
    'code' => 'Safe', // 插件标识
    'name' => '易优安全锁', // 插件名称
    'version' => 'v1.0.4', // 插件版本号
    'min_version' => 'v1.6.7', // CMS最低版本支持
    'author' => '小虎哥', // 开发者
    'description' => '加强网站安全防护，勾选禁止部分不常用功能，但凡在ip白名单外的保存、上传、升级、后台登录的功能。', // 插件描述
    'litpic'    => '/weapp/Safe/logo.jpg',
    'scene' => '0',  // 使用场景 0 PC+手机 1 手机 2 PC
    'subroot' => 'on',
    'permission' => [],
    'management' => [],
);