<?php
/**
 * 易优CMS
 * ============================================================================
 * 版权所有 2016-2028 海南赞赞网络科技有限公司，并保留所有权利。
 * 网站地址: http://www.eyoucms.com
 * ----------------------------------------------------------------------------
 * 如果商业用途务必到官方购买正版授权, 以免引起不必要的法律纠纷.
 * ============================================================================
 * Author: 小虎哥 <1105415366@qq.com>
 * Date: 2018-06-23
 */

return array(
    'code' => 'EyouGzhLogin', // 插件标识
    'name' => '后台扫码登录', // 插件名称
    'version' => 'v1.0.4', // 插件版本号
    'min_version' => 'v1.5.8', // CMS最低版本支持
    'author' => '小虎哥', // 开发者
    'description' => '支持扫码公众号登录、微信应用登录，根据个人需要选择不同的扫码方式，扫码公众号可以不需要申请微信应用，同时也节省微信开放平台的每年300元费用。', // 插件描述
    'litpic'    => '/weapp/EyouGzhLogin/logo.png',
    'scene' => '0',  // 使用场景 0 PC+手机 1 手机 2 PC
    'subroot' => 'on',
    'permission' => [],
    'management' => [],
);